log.org
#+hugo_base_dir: .

#+author:
#+hugo_custom_front_matter: :author "Moritz"
# Apparently the =tale= theme doesn't like multiple authors, so we have to go through the custom front matter ...

** Building GHC: The tools
   :PROPERTIES:
   :EXPORT_FILE_NAME: 2017-11-11-building-ghc-the-tools
   :EXPORT_DATE: <2017-11-11>
   :ID:       460157BA-0A68-43E3-911A-053D0271A5EF
   :END:

After
[[https://medium.com/@zw3rk/building-ghc-the-package-database-50c37cf6ce33][getting
to know package databases]] we are going to look into the set of tools
that are used when building the Glasgow Haskell Compiler.

*** alex & happy
    :PROPERTIES:
    :ID:       6D6703B3-5302-4F53-B0ED-0D0974AD8FEC
    :END:

[[https://www.haskell.org/alex/doc/html/index.html][alex]] is a tool to
generate lexical analysers in Haskell, and as such can turn =.x= files
into =.hs= files.
[[https://www.haskell.org/happy/doc/html/index.html][happy]] is a parser
generator, which can turn =.y= files into =.hs= files.

*** ghc-pkg
    :PROPERTIES:
    :ID:       01CBE4FE-EDFD-465E-BC95-3E3D8431E8EC
    :END:

We saw during
[[https://medium.com/@zw3rk/building-ghc-the-package-database-50c37cf6ce33][getting
to know package databases]]. It is the command line interface to the
package databases.

*** ghc-cabal
    :PROPERTIES:
    :ID:       1673F0A2-B86A-4844-8F2A-D43AE39D0616
    :END:

While cabal comes with the =Cabal= library and the =cabal= command line
tool in the =cabal-install= package. The build system needs an easy way
to just extract values from =.cabal= files and add some customizations
to configuring, copying, and registering packages via cabal. This is
what =ghc-cabal= is for. It produces the =package-data.mk= file, which
is a Makefile that contains information from the =.cabal= file, such as
it's Haskell Sources, C Sources, ... and as such provides the Make based
build system with sufficient information to build all the libraries.
/Yes, we do/ */not/* /use/ =cabal= /to build GHC./

*** deriveConstants
    :PROPERTIES:
    :ID:       4C1A5327-741B-4901-827D-76E22C34F5DB
    :END:

This utility is used during the build process to generate header files
containing constant values (word sizes, ...) of the target platform and
when the compiler is built those are included to provide those target
specific information.

*** hsc2hs
    :PROPERTIES:
    :ID:       CBC0E32F-F14C-43B4-B63E-C698F761DA9B
    :END:

When binding to C libraries, the process can be quite tedious and
=hsc2hs= tries to make this a bit easier. It is also used quite a lot
outside of GHC itself. It even has its own
[[http://downloads.haskell.org/~ghc/master/users-guide/utils.html#writing-haskell-interfaces-to-c-code-hsc2hs][GHC
User's Guide entry]].

*** genapply & genprimopcode
    :PROPERTIES:
    :ID:       CE68BA1C-9076-4862-8F07-1BCD6C6C1245
    :END:

GHCs runtime system needs to apply functions of various arities when
evaluating a program. =genapply= produces the =AutoApply.cmm= file which
is part of the =rts= package. The =AutoApply.cmm= file defines the
standard closures used to represent application of functions of various
artities.

Functions that can not be implement in Haskell directly are called
Primitive Operations (PrimOps) while these functions are provided
natively by GHC, the =genprimopcode= utility uses a highlevel
description of the PrimOps in the =compiler/prelude/primops.txt.pp= and
produces the necessary plumbing around them: header files, curried
wrappers, haddock information.

*** touchy
    :PROPERTIES:
    :ID:       918F773E-2BB4-403A-B599-6397032AD6A3
    :END:

While unix systems have the =touch= command. Windows does not. As GHC
uses =touch= during building and compilation of Haskell files, =touchy=
is required on Windows as a substitute.

*** unlit
    :PROPERTIES:
    :ID:       8F075199-7726-4C31-AE88-E051D0B570EC
    :END:

As GHC has support for Literate Haskell, it needs to be able to extract
the Haskell source from a =.lhs= source file. =unlit= is the filter that
can stirp the literate part out of a =.lhs= file and just leave
the =.hs= part.

--------------

*** compareSizes
    :PROPERTIES:
    :ID:       F38481AD-56EF-4A14-9983-77E83FDFE12C
    :END:

When comparing two ghc builds, it can be of interest to see whether or
not the file size of haskell interface files (=.hi=) or objects (=.o=)
has increased or decreased. As such the compareSizes utility is not
essential to build GHC, but useful when trying to gauge what effect a
change has on interface and object file sizes.

*** hp2ps
    :PROPERTIES:
    :ID:       852CB382-A526-440E-A4B8-655CA744F1E8
    :END:

The =hp2ps= tool is also widely used. It turns a heap profile generated
by GHC into a (hopefully) easier to undertand graphical representation.

*** ghctags
    :PROPERTIES:
    :ID:       F6E4EA70-E9C8-4DFE-823C-9676CF241ECE
    :END:

=vim= and =emacs= can read so called =TAGS= files, which provide an
index to source-code definitions of function, variables, and other
points of interest.

=ghctags= is capable of generating such a file for Haskell sources. As
such it is also a not an essential utility to /build/ GHC.

*** hpc
    :PROPERTIES:
    :ID:       538DE390-5834-4840-B4CF-43BF22E5FA7F
    :END:

The =hpc= tool can be used to generate code coverage reports for Haskell
code. It even has it's own
[[https://wiki.haskell.org/Haskell_program_coverage][page on the haskell
wiki]].

--------------

In conclusion I hope this was somewhat informative. And while not all
tools are strictly used to /build/ GHC. I believe this covers all the
utilities that are part of the GHC source tree.

